import pulp
#求解下列线性规划问题
#maxz = 2x1+3x2+x3
#x1+2x2+4x3 = 101
#x1+4x2+2x3>=8
#3x1+2x2>=6
#x1,x2,x3>=0
#一个农民承包了6块耕地共三百亩，准备播种小麦、玉米、水果和蔬菜四种农产品，各种农产品的计划播种面积、每块土地种植不同农产品的单产收益如下表：
#————————————————————————————————————————————————————————————————————————————————
#                  单产收益（元/亩）                              计划播种面积
#          地块一   地块二    地块三  地块四   地块五   地块六
#小麦      500      550      630      1000    800       700            76
#玉米      800     700       600       950    900       930           88
#水果      1000   960       840        650     600     700            96
#蔬菜      1200    1040     980        860      880       780          40
#地块面积（亩）42  56         44        39      60      59
#问如何安排种植计划，可得到最大的总收益

z = [2,3,1]
a = [[1,4,2],[3,2,0]]
b = [8,6]
#确定最大化最小化问题，最大化只要把Min改成Max即可
m = pulp.LpProblem(sense = pulp.LpMinimize)
#定义三个变量放到列表中
x = [pulp.LpVariable(f'x{i}',lowBound=0) for i in [1,2,3]]
#定义目标函数，lpDot可以将两个列表的对应位相乘再加和
#相当于在z[0]*x[0]+z[1]*x[1]+z[2]*x[2]
m += pulp.lpDot(z,x)
#设置约束条件
for i in range(len(a)):
    m +=(pulp.lpDot(a[i],x) >=b[i])
#求解
m.solve()
#输出结果
print(f'优化结果:{pulp.value(m.objective)}')
print(f'参数取值:{[pulp.value(var) for var in x]}')
